results/4-loadtest/ibm_results/ibm_dotnet_100.txt
Running 1m test @ https://us-east.functions.cloud.ibm.com/api/v1/web/functionOrg_functionSpace/default/dotnet_matrix.json
  2 threads and 100 connections
  Thread calibration: mean lat.: 2341.772ms, rate sampling interval: 14295ms
  Thread calibration: mean lat.: 1331.375ms, rate sampling interval: 11673ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   390.75ms  715.81ms   8.51s    96.32%
    Req/Sec    48.43      3.77    57.00     85.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  226.94ms
 75.000%  312.32ms
 90.000%  493.31ms
 99.000%    4.67s 
 99.900%    7.32s 
 99.990%    8.52s 
 99.999%    8.52s 
100.000%    8.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     140.799     0.000000            1         1.00
     186.239     0.100000          491         1.11
     198.527     0.200000          980         1.25
     207.743     0.300000         1476         1.43
     216.959     0.400000         1956         1.67
     226.943     0.500000         2444         2.00
     233.343     0.550000         2690         2.22
     242.815     0.600000         2934         2.50
     254.591     0.650000         3179         2.86
     269.055     0.700000         3423         3.33
     312.319     0.750000         3669         4.00
     325.119     0.775000         3790         4.44
     355.071     0.800000         3912         5.00
     447.231     0.825000         4033         5.71
     464.895     0.850000         4158         6.67
     477.183     0.875000         4277         8.00
     486.655     0.887500         4339         8.89
     493.311     0.900000         4401        10.00
     501.247     0.912500         4461        11.43
     511.743     0.925000         4525        13.33
     524.287     0.937500         4585        16.00
     538.111     0.943750         4616        17.78
     559.103     0.950000         4644        20.00
     587.263     0.956250         4675        22.86
    1064.959     0.962500         4705        26.67
    1662.975     0.968750         4736        32.00
    1885.183     0.971875         4752        35.56
    2332.671     0.975000         4766        40.00
    2676.735     0.978125         4782        45.71
    3209.215     0.981250         4797        53.33
    3616.767     0.984375         4812        64.00
    3876.863     0.985938         4820        71.11
    4167.679     0.987500         4827        80.00
    4476.927     0.989062         4835        91.43
    4714.495     0.990625         4843       106.67
    5234.687     0.992188         4850       128.00
    5345.279     0.992969         4854       142.22
    5488.639     0.993750         4858       160.00
    5636.095     0.994531         4862       182.86
    5681.151     0.995313         4866       213.33
    6180.863     0.996094         4869       256.00
    6316.031     0.996484         4871       284.44
    6467.583     0.996875         4873       320.00
    6483.967     0.997266         4875       365.71
    6504.447     0.997656         4877       426.67
    6844.415     0.998047         4879       512.00
    7286.783     0.998242         4881       568.89
    7286.783     0.998437         4881       640.00
    7299.071     0.998633         4882       731.43
    7319.551     0.998828         4883       853.33
    7356.415     0.999023         4884      1024.00
    7356.415     0.999121         4884      1137.78
    7667.711     0.999219         4885      1280.00
    7667.711     0.999316         4885      1462.86
    7671.807     0.999414         4886      1706.67
    7671.807     0.999512         4886      2048.00
    7671.807     0.999561         4886      2275.56
    8503.295     0.999609         4887      2560.00
    8503.295     0.999658         4887      2925.71
    8503.295     0.999707         4887      3413.33
    8503.295     0.999756         4887      4096.00
    8503.295     0.999780         4887      4551.11
    8519.679     0.999805         4888      5120.00
    8519.679     1.000000         4888          inf
#[Mean    =      390.754, StdDeviation   =      715.813]
#[Max     =     8511.488, Total count    =         4888]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5666 requests in 1.00m, 4.92MB read
  Socket errors: connect 0, read 0, write 0, timeout 230
  Non-2xx or 3xx responses: 9
Requests/sec:     94.15
Transfer/sec:     83.76KB