results/4-loadtest/ibm_results/ibm_dotnet_1000.txt
Running 1m test @ https://us-east.functions.cloud.ibm.com/api/v1/web/functionOrg_functionSpace/default/dotnet_matrix.json
  2 threads and 1000 connections
  Thread calibration: mean lat.: 528.104ms, rate sampling interval: 2324ms
  Thread calibration: mean lat.: 490.420ms, rate sampling interval: 2123ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   263.04ms  127.72ms   2.68s    87.27%
    Req/Sec   498.21     30.68   580.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  236.41ms
 75.000%  295.17ms
 90.000%  416.77ms
 99.000%  690.69ms
 99.900%    1.68s 
 99.990%    2.36s 
 99.999%    2.68s 
100.000%    2.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     125.183     0.000000            1         1.00
     154.495     0.100000         4747         1.11
     171.647     0.200000         9474         1.25
     192.895     0.300000        14177         1.43
     215.039     0.400000        18904         1.67
     236.415     0.500000        23631         2.00
     246.783     0.550000        25995         2.22
     256.127     0.600000        28362         2.50
     266.495     0.650000        30725         2.86
     279.295     0.700000        33109         3.33
     295.167     0.750000        35442         4.00
     305.407     0.775000        36629         4.44
     319.487     0.800000        37793         5.00
     338.431     0.825000        38984         5.71
     360.447     0.850000        40156         6.67
     386.559     0.875000        41341         8.00
     403.455     0.887500        41931         8.89
     416.767     0.900000        42519        10.00
     429.567     0.912500        43117        11.43
     443.903     0.925000        43709        13.33
     458.751     0.937500        44290        16.00
     470.015     0.943750        44583        17.78
     482.303     0.950000        44884        20.00
     495.615     0.956250        45179        22.86
     511.231     0.962500        45472        26.67
     528.383     0.968750        45771        32.00
     537.599     0.971875        45913        35.56
     550.399     0.975000        46061        40.00
     569.855     0.978125        46210        45.71
     591.359     0.981250        46357        53.33
     620.031     0.984375        46502        64.00
     642.047     0.985938        46576        71.11
     661.503     0.987500        46650        80.00
     677.375     0.989062        46724        91.43
     696.831     0.990625        46800       106.67
     719.359     0.992188        46871       128.00
     733.183     0.992969        46909       142.22
     745.471     0.993750        46947       160.00
     763.391     0.994531        46982       182.86
     779.263     0.995313        47019       213.33
     812.543     0.996094        47056       256.00
     851.967     0.996484        47074       284.44
     882.687     0.996875        47094       320.00
     921.599     0.997266        47111       365.71
     959.487     0.997656        47131       426.67
     969.727     0.998047        47148       512.00
    1085.439     0.998242        47157       568.89
    1268.735     0.998437        47167       640.00
    1380.351     0.998633        47176       731.43
    1540.095     0.998828        47185       853.33
    1701.887     0.999023        47194      1024.00
    1757.183     0.999121        47200      1137.78
    1774.591     0.999219        47204      1280.00
    1829.887     0.999316        47208      1462.86
    1930.239     0.999414        47213      1706.67
    2001.919     0.999512        47217      2048.00
    2063.359     0.999561        47220      2275.56
    2109.439     0.999609        47222      2560.00
    2117.631     0.999658        47224      2925.71
    2156.543     0.999707        47227      3413.33
    2183.167     0.999756        47229      4096.00
    2197.503     0.999780        47230      4551.11
    2213.887     0.999805        47231      5120.00
    2215.935     0.999829        47232      5851.43
    2318.335     0.999854        47234      6826.67
    2355.199     0.999878        47235      8192.00
    2355.199     0.999890        47235      9102.22
    2357.247     0.999902        47236     10240.00
    2357.247     0.999915        47236     11702.86
    2402.303     0.999927        47237     13653.33
    2603.007     0.999939        47238     16384.00
    2603.007     0.999945        47238     18204.44
    2603.007     0.999951        47238     20480.00
    2603.007     0.999957        47238     23405.71
    2674.687     0.999963        47239     27306.67
    2674.687     0.999969        47239     32768.00
    2674.687     0.999973        47239     36408.89
    2674.687     0.999976        47239     40960.00
    2674.687     0.999979        47239     46811.43
    2682.879     0.999982        47240     54613.33
    2682.879     1.000000        47240          inf
#[Mean    =      263.037, StdDeviation   =      127.722]
#[Max     =     2680.832, Total count    =        47240]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58660 requests in 1.00m, 50.96MB read
  Socket errors: connect 0, read 0, write 0, timeout 32
  Non-2xx or 3xx responses: 3
Requests/sec:    977.59
Transfer/sec:    869.72KB