results/4-loadtest/ibm_results/ibm_go_100.txt
Running 1m test @ https://us-east.functions.cloud.ibm.com/api/v1/web/functionOrg_functionSpace/default/go_matrix.json
  2 threads and 100 connections
  Thread calibration: mean lat.: 355.887ms, rate sampling interval: 1212ms
  Thread calibration: mean lat.: 408.039ms, rate sampling interval: 1300ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.73s     5.98s   32.83s    86.96%
    Req/Sec    52.61     19.24   113.00     65.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  220.80ms
 75.000%  477.18ms
 90.000%   12.16s 
 99.000%   25.56s 
 99.900%   31.98s 
 99.990%   32.83s 
 99.999%   32.85s 
100.000%   32.85s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     118.847     0.000000            1         1.00
     174.847     0.100000          529         1.11
     185.599     0.200000         1055         1.25
     196.351     0.300000         1583         1.43
     206.719     0.400000         2108         1.67
     220.799     0.500000         2635         2.00
     227.583     0.550000         2899         2.22
     238.335     0.600000         3164         2.50
     359.679     0.650000         3426         2.86
     452.351     0.700000         3689         3.33
     477.183     0.750000         3953         4.00
     501.503     0.775000         4084         4.44
     660.479     0.800000         4216         5.00
    3506.175     0.825000         4347         5.71
    6463.487     0.850000         4480         6.67
    9428.991     0.875000         4611         8.00
   10772.479     0.887500         4677         8.89
   12156.927     0.900000         4743        10.00
   13672.447     0.912500         4809        11.43
   14999.551     0.925000         4874        13.33
   16449.535     0.937500         4940        16.00
   17154.047     0.943750         4973        17.78
   17891.327     0.950000         5006        20.00
   18644.991     0.956250         5039        22.86
   19644.415     0.962500         5072        26.67
   20758.527     0.968750         5105        32.00
   21102.591     0.971875         5122        35.56
   21790.719     0.975000         5139        40.00
   22429.695     0.978125         5154        45.71
   23035.903     0.981250         5171        53.33
   24084.479     0.984375         5187        64.00
   24412.159     0.985938         5197        71.11
   25018.367     0.987500         5205        80.00
   25264.127     0.989062         5213        91.43
   25968.639     0.990625         5220       106.67
   26853.375     0.992188         5228       128.00
   27230.207     0.992969         5232       142.22
   27820.031     0.993750         5237       160.00
   28082.175     0.994531         5241       182.86
   28737.535     0.995313         5245       213.33
   29556.735     0.996094         5249       256.00
   29884.415     0.996484         5251       284.44
   30097.407     0.996875         5253       320.00
   30703.615     0.997266         5255       365.71
   30900.223     0.997656         5257       426.67
   31145.983     0.998047         5259       512.00
   31162.367     0.998242         5260       568.89
   31735.807     0.998437         5261       640.00
   31834.111     0.998633         5262       731.43
   31981.567     0.998828         5264       853.33
   31981.567     0.999023         5264      1024.00
   32292.863     0.999121         5265      1137.78
   32292.863     0.999219         5265      1280.00
   32669.695     0.999316         5266      1462.86
   32669.695     0.999414         5266      1706.67
   32784.383     0.999512         5267      2048.00
   32784.383     0.999561         5267      2275.56
   32784.383     0.999609         5267      2560.00
   32833.535     0.999658         5268      2925.71
   32833.535     0.999707         5268      3413.33
   32833.535     0.999756         5268      4096.00
   32833.535     0.999780         5268      4551.11
   32833.535     0.999805         5268      5120.00
   32849.919     0.999829         5269      5851.43
   32849.919     1.000000         5269          inf
#[Mean    =     2730.545, StdDeviation   =     5978.447]
#[Max     =    32833.536, Total count    =         5269]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5902 requests in 1.00m, 5.13MB read
  Socket errors: connect 0, read 0, write 0, timeout 385
Requests/sec:     98.11
Transfer/sec:     87.29KB